Revit 2027 API
CylindricalHelix.BasePoint Property
The base point of the axis of the cylindrical helix.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ BasePoint { get; }
Public ReadOnly Property BasePoint As XYZ
	Get
public:
property XYZ^ BasePoint {
	XYZ^ get ();
}
member BasePoint : XYZ with get
Property Value
XYZ
See Also
Reference
CylindricalHelix Class
Autodesk.Revit.DB Namespace